clc;
close all;
clear all;

x=xlsread('1.xlsx');


MAX=max(x);
MIN=min(x);
M=mean(x);

%Нормирование 
for i=1:1:size(x,1)
    X(i,1)=(x(i,1)-M(1))/(MAX(1)-MIN(1));
%     X(i,2)=(x(i,2)-M(2))/(MAX(2)-MIN(2));
%     X(i,3)=(x(i,3)-M(3))/(MAX(3)-MIN(3));
%     X(i,4)=(x(i,4)-M(4))/(MAX(4)-MIN(4));
%     X(i,5)=(x(i,5)-M(5))/(MAX(5)-MIN(5));
end


n=size(X,1);
%Построение гистограмм
horz=1:1:n;

figure
bar(horz,X(:, 1));
% title('Реальные денежные доходы населения')
% 
% figure
% bar(horz,X(:, 2));
% title('Число образовательных организаций высшего образования и научных организаций')
% 
% figure
% bar(horz,X(:, 3));
% title('Численность населения с денежными доходами ниже величины прожиточного минимума')
% 
% figure
% bar(horz,X(:, 4));
% title('Коэффициент миграции');
% 
% figure
% bar(horz,X(:, 5));
% title('Изменение среднегодовой численности занятых');
